STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp233dxx_cm33.h
/*****************  Bit definition for ETH_MACWJBTR register  *****************/
#define ETH_MACWJBTR_WTO_Pos                (0U)
#define ETH_MACWJBTR_WTO_Msk                (0xFUL << ETH_MACWJBTR_WTO_Pos)                       /*!< 0x0000000F */
#define ETH_MACWJBTR_WTO                    ETH_MACWJBTR_WTO_Msk                                /*!< Watchdog Timeout */
#define ETH_MACWJBTR_WTO_2KB                (0x0UL << ETH_MACWJBTR_WTO_Pos)                       /*!< 0x00000001 */
#define ETH_MACWJBTR_WTO_3KB                (0x1UL << ETH_MACWJBTR_WTO_Pos)                       /*!< 0x00000001 */
#define ETH_MACWJBTR_WTO_4KB                (0x2UL << ETH_MACWJBTR_WTO_Pos)                       /*!< 0x00000002 */
#define ETH_MACWJBTR_WTO_5KB                (0x3UL << ETH_MACWJBTR_WTO_Pos)                       /*!< 0x00000003 */
#define ETH_MACWJBTR_WTO_6KB                (0x4UL << ETH_MACWJBTR_WTO_Pos)                       /*!< 0x00000004 */
#define ETH_MACWJBTR_WTO_7KB                (0x5UL << ETH_MACWJBTR_WTO_Pos)                       /*!< 0x00000005 */
#define ETH_MACWJBTR_WTO_8KB                (0x6UL << ETH_MACWJBTR_WTO_Pos)                       /*!< 0x00000006 */
#define ETH_MACWJBTR_WTO_9KB                (0x7UL << ETH_MACWJBTR_WTO_Pos)                       /*!< 0x00000007 */
#define ETH_MACWJBTR_WTO_10KB               (0x8UL << ETH_MACWJBTR_WTO_Pos)                       /*!< 0x00000008 */
#define ETH_MACWJBTR_WTO_11KB               (0x9UL << ETH_MACWJBTR_WTO_Pos)                       /*!< 0x00000009 */
#define ETH_MACWJBTR_WTO_12KB               (0xAUL << ETH_MACWJBTR_WTO_Pos)                       /*!< 0x0000000A */
#define ETH_MACWJBTR_WTO_13KB               (0xBUL << ETH_MACWJBTR_WTO_Pos)                       /*!< 0x0000000B */
#define ETH_MACWJBTR_WTO_14KB               (0xCUL << ETH_MACWJBTR_WTO_Pos)                       /*!< 0x0000000C */
#define ETH_MACWJBTR_WTO_15KB               (0xDUL << ETH_MACWJBTR_WTO_Pos)                       /*!< 0x0000000D */
#define ETH_MACWJBTR_WTO_16KB               (0xEUL << ETH_MACWJBTR_WTO_Pos)                       /*!< 0x0000000E */
#define ETH_MACWJBTR_PWE_Pos                (8U)
#define ETH_MACWJBTR_PWE_Msk                (0x1UL << ETH_MACWJBTR_PWE_Pos)                       /*!< 0x00000100 */
#define ETH_MACWJBTR_PWE                    ETH_MACWJBTR_PWE_Msk                                /*!< Programmable Watchdog Enable */
#define ETH_MACWJBTR_JTO_Pos                (16U)
#define ETH_MACWJBTR_JTO_Msk                (0xFUL << ETH_MACWJBTR_JTO_Pos)                       /*!< 0x000F0000 */
#define ETH_MACWJBTR_JTO                    ETH_MACWJBTR_JTO_Msk                                /*!< Jabber Timeout */
#define ETH_MACWJBTR_PJE_Pos                (24U)
#define ETH_MACWJBTR_PJE_Msk                (0x1UL << ETH_MACWJBTR_PJE_Pos)                       /*!< 0x01000000 */
#define ETH_MACWJBTR_PJE                    ETH_MACWJBTR_PJE_Msk                                /*!< Programmable Jabber Enable */

/**************  Bit definition for ETH_MACHT0R register  **************/
#define ETH_MACHT0R_HT31T0_Pos              (0U)
#define ETH_MACHT0R_HT31T0_Msk              (0xFFFFFFFFUL << ETH_MACHT0R_HT31T0_Pos)             /*!< 0xFFFFFFFF */
#define ETH_MACHT0R_HT31T0                  ETH_MACHT0R_HT31T0_Msk                              /*!< MAC Hash Table First 32 Bits */
#define ETH_MACHT0R_HT31T0_0                (0x1UL << ETH_MACHT0R_HT31T0_Pos)                    /*!< 0x00000001 */
#define ETH_MACHT0R_HT31T0_1                (0x2UL << ETH_MACHT0R_HT31T0_Pos)                    /*!< 0x00000002 */
#define ETH_MACHT0R_HT31T0_2                (0x4UL << ETH_MACHT0R_HT31T0_Pos)                    /*!< 0x00000004 */
#define ETH_MACHT0R_HT31T0_3                (0x8UL << ETH_MACHT0R_HT31T0_Pos)                    /*!< 0x00000008 */
#define ETH_MACHT0R_HT31T0_4                (0x10UL << ETH_MACHT0R_HT31T0_Pos)                   /*!< 0x00000010 */
#define ETH_MACHT0R_HT31T0_5                (0x20UL << ETH_MACHT0R_HT31T0_Pos)                   /*!< 0x00000020 */
#define ETH_MACHT0R_HT31T0_6                (0x40UL << ETH_MACHT0R_HT31T0_Pos)                   /*!< 0x00000040 */
#define ETH_MACHT0R_HT31T0_7                (0x80UL << ETH_MACHT0R_HT31T0_Pos)                   /*!< 0x00000080 */
#define ETH_MACHT0R_HT31T0_8                (0x100UL << ETH_MACHT0R_HT31T0_Pos)                  /*!< 0x00000100 */
#define ETH_MACHT0R_HT31T0_9                (0x200UL << ETH_MACHT0R_HT31T0_Pos)                  /*!< 0x00000200 */
#define ETH_MACHT0R_HT31T0_10               (0x400UL << ETH_MACHT0R_HT31T0_Pos)                  /*!< 0x00000400 */
#define ETH_MACHT0R_HT31T0_11               (0x800UL << ETH_MACHT0R_HT31T0_Pos)                  /*!< 0x00000800 */
#define ETH_MACHT0R_HT31T0_12               (0x1000UL << ETH_MACHT0R_HT31T0_Pos)                 /*!< 0x00001000 */
#define ETH_MACHT0R_HT31T0_13               (0x2000UL << ETH_MACHT0R_HT31T0_Pos)                 /*!< 0x00002000 */
#define ETH_MACHT0R_HT31T0_14               (0x4000UL << ETH_MACHT0R_HT31T0_Pos)                 /*!< 0x00004000 */
#define ETH_MACHT0R_HT31T0_15               (0x8000UL << ETH_MACHT0R_HT31T0_Pos)                 /*!< 0x00008000 */
#define ETH_MACHT0R_HT31T0_16               (0x10000UL << ETH_MACHT0R_HT31T0_Pos)                /*!< 0x00010000 */
#define ETH_MACHT0R_HT31T0_17               (0x20000UL << ETH_MACHT0R_HT31T0_Pos)                /*!< 0x00020000 */
#define ETH_MACHT0R_HT31T0_18               (0x40000UL << ETH_MACHT0R_HT31T0_Pos)                /*!< 0x00040000 */
#define ETH_MACHT0R_HT31T0_19               (0x80000UL << ETH_MACHT0R_HT31T0_Pos)                /*!< 0x00080000 */
#define ETH_MACHT0R_HT31T0_20               (0x100000UL << ETH_MACHT0R_HT31T0_Pos)               /*!< 0x00100000 */
#define ETH_MACHT0R_HT31T0_21               (0x200000UL << ETH_MACHT0R_HT31T0_Pos)               /*!< 0x00200000 */
#define ETH_MACHT0R_HT31T0_22               (0x400000UL << ETH_MACHT0R_HT31T0_Pos)               /*!< 0x00400000 */
#define ETH_MACHT0R_HT31T0_23               (0x800000UL << ETH_MACHT0R_HT31T0_Pos)               /*!< 0x00800000 */
#define ETH_MACHT0R_HT31T0_24               (0x1000000UL << ETH_MACHT0R_HT31T0_Pos)              /*!< 0x01000000 */
#define ETH_MACHT0R_HT31T0_25               (0x2000000UL << ETH_MACHT0R_HT31T0_Pos)              /*!< 0x02000000 */
#define ETH_MACHT0R_HT31T0_26               (0x4000000UL << ETH_MACHT0R_HT31T0_Pos)              /*!< 0x04000000 */
#define ETH_MACHT0R_HT31T0_27               (0x8000000UL << ETH_MACHT0R_HT31T0_Pos)              /*!< 0x08000000 */
#define ETH_MACHT0R_HT31T0_28               (0x10000000UL << ETH_MACHT0R_HT31T0_Pos)             /*!< 0x10000000 */
#define ETH_MACHT0R_HT31T0_29               (0x20000000UL << ETH_MACHT0R_HT31T0_Pos)             /*!< 0x20000000 */
#define ETH_MACHT0R_HT31T0_30               (0x40000000UL << ETH_MACHT0R_HT31T0_Pos)             /*!< 0x40000000 */
#define ETH_MACHT0R_HT31T0_31               (0x80000000UL << ETH_MACHT0R_HT31T0_Pos)             /*!< 0x80000000 */

/**************  Bit definition for ETH_MACHT1R register  **************/
#define ETH_MACHT1R_HT63T32_Pos             (0U)
#define ETH_MACHT1R_HT63T32_Msk             (0xFFFFFFFFUL << ETH_MACHT1R_HT63T32_Pos)            /*!< 0xFFFFFFFF */
#define ETH_MACHT1R_HT63T32                 ETH_MACHT1R_HT63T32_Msk                             /*!< MAC Hash Table Second 32 Bits */
#define ETH_MACHT1R_HT63T32_0               (0x1UL << ETH_MACHT1R_HT63T32_Pos)                   /*!< 0x00000001 */
#define ETH_MACHT1R_HT63T32_1               (0x2UL << ETH_MACHT1R_HT63T32_Pos)                   /*!< 0x00000002 */
#define ETH_MACHT1R_HT63T32_2               (0x4UL << ETH_MACHT1R_HT63T32_Pos)                   /*!< 0x00000004 */
#define ETH_MACHT1R_HT63T32_3               (0x8UL << ETH_MACHT1R_HT63T32_Pos)                   /*!< 0x00000008 */
#define ETH_MACHT1R_HT63T32_4               (0x10UL << ETH_MACHT1R_HT63T32_Pos)                  /*!< 0x00000010 */
#define ETH_MACHT1R_HT63T32_5               (0x20UL << ETH_MACHT1R_HT63T32_Pos)                  /*!< 0x00000020 */
#define ETH_MACHT1R_HT63T32_6               (0x40UL << ETH_MACHT1R_HT63T32_Pos)                  /*!< 0x00000040 */
#define ETH_MACHT1R_HT63T32_7               (0x80UL << ETH_MACHT1R_HT63T32_Pos)                  /*!< 0x00000080 */
#define ETH_MACHT1R_HT63T32_8               (0x100UL << ETH_MACHT1R_HT63T32_Pos)                 /*!< 0x00000100 */
#define ETH_MACHT1R_HT63T32_9               (0x200UL << ETH_MACHT1R_HT63T32_Pos)                 /*!< 0x00000200 */
#define ETH_MACHT1R_HT63T32_10              (0x400UL << ETH_MACHT1R_HT63T32_Pos)                 /*!< 0x00000400 */
#define ETH_MACHT1R_HT63T32_11              (0x800UL << ETH_MACHT1R_HT63T32_Pos)                 /*!< 0x00000800 */
#define ETH_MACHT1R_HT63T32_12              (0x1000UL << ETH_MACHT1R_HT63T32_Pos)                /*!< 0x00001000 */
#define ETH_MACHT1R_HT63T32_13              (0x2000UL << ETH_MACHT1R_HT63T32_Pos)                /*!< 0x00002000 */
#define ETH_MACHT1R_HT63T32_14              (0x4000UL << ETH_MACHT1R_HT63T32_Pos)                /*!< 0x00004000 */
#define ETH_MACHT1R_HT63T32_15              (0x8000UL << ETH_MACHT1R_HT63T32_Pos)                /*!< 0x00008000 */
#define ETH_MACHT1R_HT63T32_16              (0x10000UL << ETH_MACHT1R_HT63T32_Pos)               /*!< 0x00010000 */
#define ETH_MACHT1R_HT63T32_17              (0x20000UL << ETH_MACHT1R_HT63T32_Pos)               /*!< 0x00020000 */
#define ETH_MACHT1R_HT63T32_18              (0x40000UL << ETH_MACHT1R_HT63T32_Pos)               /*!< 0x00040000 */
#define ETH_MACHT1R_HT63T32_19              (0x80000UL << ETH_MACHT1R_HT63T32_Pos)               /*!< 0x00080000 */
#define ETH_MACHT1R_HT63T32_20              (0x100000UL << ETH_MACHT1R_HT63T32_Pos)              /*!< 0x00100000 */
#define ETH_MACHT1R_HT63T32_21              (0x200000UL << ETH_MACHT1R_HT63T32_Pos)              /*!< 0x00200000 */
#define ETH_MACHT1R_HT63T32_22              (0x400000UL << ETH_MACHT1R_HT63T32_Pos)              /*!< 0x00400000 */
#define ETH_MACHT1R_HT63T32_23              (0x800000UL << ETH_MACHT1R_HT63T32_Pos)              /*!< 0x00800000 */
#define ETH_MACHT1R_HT63T32_24              (0x1000000UL << ETH_MACHT1R_HT63T32_Pos)             /*!< 0x01000000 */
#define ETH_MACHT1R_HT63T32_25              (0x2000000UL << ETH_MACHT1R_HT63T32_Pos)             /*!< 0x02000000 */
#define ETH_MACHT1R_HT63T32_26              (0x4000000UL << ETH_MACHT1R_HT63T32_Pos)             /*!< 0x04000000 */
#define ETH_MACHT1R_HT63T32_27              (0x8000000UL << ETH_MACHT1R_HT63T32_Pos)             /*!< 0x08000000 */
#define ETH_MACHT1R_HT63T32_28              (0x10000000UL << ETH_MACHT1R_HT63T32_Pos)            /*!< 0x10000000 */
#define ETH_MACHT1R_HT63T32_29              (0x20000000UL << ETH_MACHT1R_HT63T32_Pos)            /*!< 0x20000000 */
#define ETH_MACHT1R_HT63T32_30              (0x40000000UL << ETH_MACHT1R_HT63T32_Pos)            /*!< 0x40000000 */
#define ETH_MACHT1R_HT63T32_31              (0x80000000UL << ETH_MACHT1R_HT63T32_Pos)            /*!< 0x80000000 */

/**************  Bit definition for ETH_MACVTCR register  ***************/
#define ETH_MACVTCR_OB_Pos                  (0U)
#define ETH_MACVTCR_OB_Msk                  (0x1UL << ETH_MACVTCR_OB_Pos)                        /*!< 0x00000001 */
#define ETH_MACVTCR_OB                      ETH_MACVTCR_OB_Msk                                  /*!< Operation Busy */
#define ETH_MACVTCR_CT_Pos                  (1U)
#define ETH_MACVTCR_CT_Msk                  (0x1UL << ETH_MACVTCR_CT_Pos)                        /*!< 0x00000002 */
#define ETH_MACVTCR_CT                      ETH_MACVTCR_CT_Msk                                  /*!< Command Type */
#define ETH_MACVTCR_OFS_Pos                 (2U)
#define ETH_MACVTCR_OFS_Msk                 (0x3UL << ETH_MACVTCR_OFS_Pos)                       /*!< 0x00000000C */
#define ETH_MACVTCR_OFS                     ETH_MACVTCR_OFS_Msk                                 /*!< Offset */
#define ETH_MACVTCR_OFS_1                   (0x1 << ETH_MACVTCR_OFS_Pos)                        /*!< 0x000000004 */
#define ETH_MACVTCR_OFS_2                   (0x2 << ETH_MACVTCR_OFS_Pos)                        /*!< 0x000000008 */
#define ETH_MACVTCR_OFS_3                   (0x3 << ETH_MACVTCR_OFS_Pos)                        /*!< 0x00000000C */
#define ETH_MACVTCR_ETV_Pos                 (16U)
#define ETH_MACVTCR_ETV_Msk                 (0x1UL << ETH_MACVTCR_ETV_Pos)                       /*!< 0x00010000 */
#define ETH_MACVTCR_ETV                     ETH_MACVTCR_ETV_Msk                                 /*!< Enable 12-Bit VLAN Tag Comparison */
#define ETH_MACVTCR_VTIM_Pos                (17U)
#define ETH_MACVTCR_VTIM_Msk                (0x1UL << ETH_MACVTCR_VTIM_Pos)                      /*!< 0x00020000 */
#define ETH_MACVTCR_VTIM                    ETH_MACVTCR_VTIM_Msk                                /*!< VLAN Tag Inverse Match Enable */
#define ETH_MACVTCR_ESVL_Pos                (18U)
#define ETH_MACVTCR_ESVL_Msk                (0x1UL << ETH_MACVTCR_ESVL_Pos)                      /*!< 0x00040000 */
#define ETH_MACVTCR_ESVL                    ETH_MACVTCR_ESVL_Msk                                /*!< Enable S-VLAN */
#define ETH_MACVTCR_ERSVLM_Pos              (19U)
#define ETH_MACVTCR_ERSVLM_Msk              (0x1UL << ETH_MACVTCR_ERSVLM_Pos)                    /*!< 0x00080000 */
#define ETH_MACVTCR_ERSVLM                  ETH_MACVTCR_ERSVLM_Msk                              /*!< Enable Receive S-VLAN Match */
#define ETH_MACVTCR_DOVLTC_Pos              (20U)
#define ETH_MACVTCR_DOVLTC_Msk              (0x1UL << ETH_MACVTCR_DOVLTC_Pos)                    /*!< 0x00100000 */
#define ETH_MACVTCR_DOVLTC                  ETH_MACVTCR_DOVLTC_Msk                              /*!< Disable VLAN Type Check */
#define ETH_MACVTCR_EVLS_Pos                (21U)
#define ETH_MACVTCR_EVLS_Msk                (0x3UL << ETH_MACVTCR_EVLS_Pos)                      /*!< 0x00600000 */
#define ETH_MACVTCR_EVLS                    ETH_MACVTCR_EVLS_Msk                                /*!< Enable VLAN Tag Stripping on Receive */
#define ETH_MACVTCR_EVLS_DONOTSTRIP         ((uint32_t)0x00000000)                              /*!< Do not strip */
#define ETH_MACVTCR_EVLS_STRIPIFPASS_Pos    (21U)
#define ETH_MACVTCR_EVLS_STRIPIFPASS_Msk    (0x1UL << ETH_MACVTCR_EVLS_STRIPIFPASS_Pos)         /*!< 0x00200000 */
#define ETH_MACVTCR_EVLS_STRIPIFPASS        ETH_MACVTCR_EVLS_STRIPIFPASS_Msk                    /*!< Strip if VLAN filter passes */
#define ETH_MACVTCR_EVLS_STRIPIFFAILS_Pos   (22U)
#define ETH_MACVTCR_EVLS_STRIPIFFAILS_Msk   (0x1UL << ETH_MACVTCR_EVLS_STRIPIFFAILS_Pos)        /*!< 0x00400000 */
#define ETH_MACVTCR_EVLS_STRIPIFFAILS       ETH_MACVTCR_EVLS_STRIPIFFAILS_Msk                   /*!< Strip if VLAN filter fails */
#define ETH_MACVTCR_EVLS_ALWAYSSTRIP_Pos    (21U)
#define ETH_MACVTCR_EVLS_ALWAYSSTRIP_Msk    (0x3UL << ETH_MACVTCR_EVLS_ALWAYSSTRIP_Pos)         /*!< 0x00600000 */
#define ETH_MACVTCR_EVLS_ALWAYSSTRIP        ETH_MACVTCR_EVLS_ALWAYSSTRIP_Msk                    /*!< Always strip */
#define ETH_MACVTCR_EVLRXS_Pos              (24U)
#define ETH_MACVTCR_EVLRXS_Msk              (0x1UL << ETH_MACVTCR_EVLRXS_Pos)                    /*!< 0x01000000 */
#define ETH_MACVTCR_EVLRXS                  ETH_MACVTCR_EVLRXS_Msk                              /*!< Enable VLAN Tag in Rx status */
#define ETH_MACVTCR_VTHM_Pos                (25U)
#define ETH_MACVTCR_VTHM_Msk                (0x1UL << ETH_MACVTCR_VTHM_Pos)                      /*!< 0x02000000 */
#define ETH_MACVTCR_VTHM                    ETH_MACVTCR_VTHM_Msk                                /*!< VLAN Tag Hash Table Match Enable */
#define ETH_MACVTCR_EDVLP_Pos               (26U)
#define ETH_MACVTCR_EDVLP_Msk               (0x1UL << ETH_MACVTCR_EDVLP_Pos)                     /*!< 0x04000000 */
#define ETH_MACVTCR_EDVLP                   ETH_MACVTCR_EDVLP_Msk                               /*!< Enable Double VLAN Processing */
#define ETH_MACVTCR_ERIVLT_Pos              (27U)
#define ETH_MACVTCR_ERIVLT_Msk              (0x1UL << ETH_MACVTCR_ERIVLT_Pos)                    /*!< 0x08000000 */
#define ETH_MACVTCR_ERIVLT                  ETH_MACVTCR_ERIVLT_Msk                              /*!< Enable Inner VLAN Tag */
#define ETH_MACVTCR_EIVLS_Pos               (28U)
#define ETH_MACVTCR_EIVLS_Msk               (0x3UL << ETH_MACVTCR_EIVLS_Pos)                     /*!< 0x30000000 */
#define ETH_MACVTCR_EIVLS                   ETH_MACVTCR_EIVLS_Msk                               /*!< Enable Inner VLAN Tag Stripping on Receive */
#define ETH_MACVTCR_EIVLS_DONOTSTRIP        ((uint32_t)0x00000000)                              /*!<  Do not strip */
#define ETH_MACVTCR_EIVLS_STRIPIFPASS_Pos   (28U)
#define ETH_MACVTCR_EIVLS_STRIPIFPASS_Msk   (0x1UL << ETH_MACVTCR_EIVLS_STRIPIFPASS_Pos)         /*!< 0x10000000 */
#define ETH_MACVTCR_EIVLS_STRIPIFPASS       ETH_MACVTCR_EIVLS_STRIPIFPASS_Msk                   /*!<  Strip if VLAN filter passes */
#define ETH_MACVTCR_EIVLS_STRIPIFFAILS_Pos  (29U)
#define ETH_MACVTCR_EIVLS_STRIPIFFAILS_Msk  (0x1UL << ETH_MACVTCR_EIVLS_STRIPIFFAILS_Pos)        /*!< 0x20000000 */
#define ETH_MACVTCR_EIVLS_STRIPIFFAILS      ETH_MACVTCR_EIVLS_STRIPIFFAILS_Msk                  /*!<  Strip if VLAN filter fails */
#define ETH_MACVTCR_EIVLS_ALWAYSSTRIP_Pos   (28U)
#define ETH_MACVTCR_EIVLS_ALWAYSSTRIP_Msk   (0x3UL << ETH_MACVTCR_EIVLS_ALWAYSSTRIP_Pos)         /*!< 0x30000000 */
#define ETH_MACVTCR_EIVLS_ALWAYSSTRIP        ETH_MACVTCR_EIVLS_ALWAYSSTRIP_Msk                  /*!<  Always strip */
#define ETH_MACVTCR_EIVLRXS_Pos             (31U)
#define ETH_MACVTCR_EIVLRXS_Msk             (0x1UL << ETH_MACVTCR_EIVLRXS_Pos)                   /*!< 0x80000000 */
#define ETH_MACVTCR_EIVLRXS                 ETH_MACVTCR_EIVLRXS_Msk                             /*!< Enable Inner VLAN Tag in Rx Status */

/**************  Bit definition for ETH_MACVTDR register  ***************/
#define ETH_MACVTDR_VID_Pos                 (0U)
#define ETH_MACVTDR_VID_Msk                 (0xFFFFUL << ETH_MACVTDR_VID_Pos)                    /*!< 0x0000FFFF */
#define ETH_MACVTDR_VID                     ETH_MACVTDR_VID_Msk                                 /*!< VLAN Tag Identifier field of VLAN tag */
#define ETH_MACVTDR_VID_12BIT_Msk           (0xFFFUL << ETH_MACVTDR_VID_Pos)                     /*!< 0x00000FFF */
#define ETH_MACVTDR_VID_12BIT               ETH_MACVTDR_VID_12BIT_Msk                           /*!< VLAN Tag Identifier field of VLAN tag 12bit */
#define ETH_MACVTDR_VID_16BIT_Msk           (0xFFFFUL << ETH_MACVTDR_VID_Pos)                    /*!< 0x0000FFFF */
#define ETH_MACVTDR_VID_16BIT               ETH_MACVTDR_VID_16BIT_Msk                           /*!< VLAN Tag Identifier field of VLAN tag 16bit */
#define ETH_MACVTDR_VID_0                   (0x1UL << ETH_MACVTDR_VID_Pos)                       /*!< 0x00000001 */
#define ETH_MACVTDR_VID_1                   (0x2UL << ETH_MACVTDR_VID_Pos)                       /*!< 0x00000002 */
#define ETH_MACVTDR_VID_2                   (0x4UL << ETH_MACVTDR_VID_Pos)                       /*!< 0x00000004 */
#define ETH_MACVTDR_VID_3                   (0x8UL << ETH_MACVTDR_VID_Pos)                       /*!< 0x00000008 */
#define ETH_MACVTDR_VID_4                   (0x10UL << ETH_MACVTDR_VID_Pos)                      /*!< 0x00000010 */
#define ETH_MACVTDR_VID_5                   (0x20UL << ETH_MACVTDR_VID_Pos)                      /*!< 0x00000020 */
#define ETH_MACVTDR_VID_6                   (0x40UL << ETH_MACVTDR_VID_Pos)                      /*!< 0x00000040 */
#define ETH_MACVTDR_VID_7                   (0x80UL << ETH_MACVTDR_VID_Pos)                      /*!< 0x00000080 */
#define ETH_MACVTDR_VID_8                   (0x100UL << ETH_MACVTDR_VID_Pos)                     /*!< 0x00000100 */
#define ETH_MACVTDR_VID_9                   (0x200UL << ETH_MACVTDR_VID_Pos)                     /*!< 0x00000200 */
#define ETH_MACVTDR_VID_10                  (0x400UL << ETH_MACVTDR_VID_Pos)                     /*!< 0x00000400 */
#define ETH_MACVTDR_VID_11                  (0x800UL << ETH_MACVTDR_VID_Pos)                     /*!< 0x00000800 */
#define ETH_MACVTDR_VID_12                  (0x1000UL << ETH_MACVTDR_VID_Pos)                    /*!< 0x00001000 */
#define ETH_MACVTDR_VID_13                  (0x2000UL << ETH_MACVTDR_VID_Pos)                    /*!< 0x00002000 */
#define ETH_MACVTDR_VID_14                  (0x4000UL << ETH_MACVTDR_VID_Pos)                    /*!< 0x00004000 */
#define ETH_MACVTDR_VID_15                  (0x8000UL << ETH_MACVTDR_VID_Pos)                    /*!< 0x00008000 */
#define ETH_MACVTDR_VEN_Pos                 (16U)
#define ETH_MACVTDR_VEN_Msk                 (0x1UL << ETH_MACVTDR_VEN_Pos)                       /*!< 0x00010000 */
#define ETH_MACVTDR_VEN                     ETH_MACVTDR_ETV_Msk                                 /*!< VLAN Tag Enable */
#define ETH_MACVTDR_ETV_Pos                 (17U)
#define ETH_MACVTDR_ETV_Msk                 (0x1UL << ETH_MACVTDR_ETV_Pos)                       /*!< 0x00020000 */
#define ETH_MACVTDR_ETV                     ETH_MACVTDR_ETV_Msk                                 /*!< Enable 12-Bit or 16-bit VLAN Tag Comparison */
#define ETH_MACVTDR_DOVLTC_Pos              (18U)
#define ETH_MACVTDR_DOVLTC_Msk              (0x1UL << ETH_MACVTDR_DOVLTC_Pos)                    /*!< 0x00040000 */
#define ETH_MACVTDR_DOVLTC                  ETH_MACVTDR_DOVLTC_Msk                              /*!< Disable VLAN Type Check */
#define ETH_MACVTDR_ERSVLM_Pos              (19U)
#define ETH_MACVTDR_ERSVLM_Msk              (0x1UL << ETH_MACVTDR_ERSVLM_Pos)                    /*!< 0x00080000 */
#define ETH_MACVTDR_ERSVLM                  ETH_MACVTDR_ERSVLM_Msk                              /*!< Enable Receive S-VLAN Match */
#define ETH_MACVTDR_ERIVLT_Pos              (20U)
#define ETH_MACVTDR_ERIVLT_Msk              (0x1UL << ETH_MACVTDR_ERIVLT_Pos)                    /*!< 0x00100000 */
#define ETH_MACVTDR_ERIVLT                  ETH_MACVTDR_ERIVLT_Msk                              /*!< Enable Inner VLAN Tag */
#define ETH_MACVTDR_DMACHEN_Pos             (24U)
#define ETH_MACVTDR_DMACHEN_Msk             (0x1UL << ETH_MACVTDR_DMACHEN_Pos)                   /*!< 0x01000000 */
#define ETH_MACVTDR_DMACHEN                 ETH_MACVTDR_DMACHEN_Msk                             /*!< DMA Channel Enable */
#define ETH_MACVTDR_DMACHN_Pos              (25U)
#define ETH_MACVTDR_DMACHN_Msk              (0x1UL << ETH_MACVTDR_DMACHEN_Pos)                   /*!< 0x02000000 */
#define ETH_MACVTDR_DMACHN                  ETH_MACVTDR_DMACHEN_Msk                             /*!< DMA Channel Number */

