STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp233dxx_cm33.h
/*******************  Bit definition for EXTI2_CmIMR3 register  *******************/
#define EXTI2_IMR3_IM64_Pos         (0U)
#define EXTI2_IMR3_IM64_Msk         (0x1UL << EXTI2_IMR3_IM64_Pos)                /*!< 0x00000001 */
#define EXTI2_IMR3_IM64             EXTI2_IMR3_IM64_Msk                          /*!< Interrupt Mask on line 64 */
#define EXTI2_IMR3_IM65_Pos         (1U)
#define EXTI2_IMR3_IM65_Msk         (0x1UL << EXTI2_IMR3_IM65_Pos)                /*!< 0x00000002 */
#define EXTI2_IMR3_IM65             EXTI2_IMR3_IM65_Msk                          /*!< Interrupt Mask on line 65 */
#define EXTI2_IMR3_IM66_Pos         (2U)
#define EXTI2_IMR3_IM66_Msk         (0x1UL << EXTI2_IMR3_IM66_Pos)                /*!< 0x00000004 */
#define EXTI2_IMR3_IM66             EXTI2_IMR3_IM66_Msk                          /*!< Interrupt Mask on line 66 */
#define EXTI2_IMR3_IM67_Pos         (3U)
#define EXTI2_IMR3_IM67_Msk         (0x1UL << EXTI2_IMR3_IM67_Pos)                /*!< 0x00000008 */
#define EXTI2_IMR3_IM67             EXTI2_IMR3_IM67_Msk                          /*!< Interrupt Mask on line 67 */
#define EXTI2_IMR3_IM68_Pos         (4U)
#define EXTI2_IMR3_IM68_Msk         (0x1UL << EXTI2_IMR3_IM68_Pos)                /*!< 0x00000010 */
#define EXTI2_IMR3_IM68             EXTI2_IMR3_IM68_Msk                          /*!< Interrupt Mask on line 68 */
#define EXTI2_IMR3_IM69_Pos         (5U)
#define EXTI2_IMR3_IM69_Msk         (0x1UL << EXTI2_IMR3_IM69_Pos)                /*!< 0x00000020 */
#define EXTI2_IMR3_IM69             EXTI2_IMR3_IM69_Msk                          /*!< Interrupt Mask on line 69 */
#define EXTI2_IMR3_IM70_Pos         (6U)
#define EXTI2_IMR3_IM70_Msk         (0x1UL << EXTI2_IMR3_IM70_Pos)                /*!< 0x00000040 */
#define EXTI2_IMR3_IM70             EXTI2_IMR3_IM70_Msk                          /*!< Interrupt Mask on line 70 */
/* No interrupt line 71 */
/* No interrupt line 72 */
/* No interrupt line 73 */
/* No interrupt line 74 */
/* No interrupt line 75 */
#define EXTI2_IMR3_IM76_Pos         (12U)
#define EXTI2_IMR3_IM76_Msk         (0x1UL << EXTI2_IMR3_IM76_Pos)                /*!< 0x00001000 */
#define EXTI2_IMR3_IM76             EXTI2_IMR3_IM76_Msk                          /*!< Interrupt Mask on line 76 */





/******************************************************************************/
/*                                                                            */
/*                 Flexible Datarate Controller Area Network                  */
/*                                                                            */
/******************************************************************************/
/*!<FDCAN control and status registers */
/*****************  Bit definition for FDCAN_CREL register  *******************/
#define FDCAN_CREL_DAY_Pos        (0U)
#define FDCAN_CREL_DAY_Msk        (0xFFUL << FDCAN_CREL_DAY_Pos)                /*!< 0x000000FF */
#define FDCAN_CREL_DAY            FDCAN_CREL_DAY_Msk                           /*!<Timestamp Day                           */
#define FDCAN_CREL_MON_Pos        (8U)
#define FDCAN_CREL_MON_Msk        (0xFFUL << FDCAN_CREL_MON_Pos)                /*!< 0x0000FF00 */
#define FDCAN_CREL_MON            FDCAN_CREL_MON_Msk                           /*!<Timestamp Month                         */
#define FDCAN_CREL_YEAR_Pos       (16U)
#define FDCAN_CREL_YEAR_Msk       (0xFUL << FDCAN_CREL_YEAR_Pos)                /*!< 0x000F0000 */
#define FDCAN_CREL_YEAR           FDCAN_CREL_YEAR_Msk                          /*!<Timestamp Year                          */
#define FDCAN_CREL_SUBSTEP_Pos    (20U)
#define FDCAN_CREL_SUBSTEP_Msk    (0xFUL << FDCAN_CREL_SUBSTEP_Pos)             /*!< 0x00F00000 */
#define FDCAN_CREL_SUBSTEP        FDCAN_CREL_SUBSTEP_Msk                       /*!<Sub-step of Core release                */
#define FDCAN_CREL_STEP_Pos       (24U)
#define FDCAN_CREL_STEP_Msk       (0xFUL << FDCAN_CREL_STEP_Pos)                /*!< 0x0F000000 */
#define FDCAN_CREL_STEP           FDCAN_CREL_STEP_Msk                          /*!<Step of Core release                    */
#define FDCAN_CREL_REL_Pos        (28U)
#define FDCAN_CREL_REL_Msk        (0xFUL << FDCAN_CREL_REL_Pos)                 /*!< 0xF0000000 */
#define FDCAN_CREL_REL            FDCAN_CREL_REL_Msk                           /*!<Core release                            */

/*****************  Bit definition for FDCAN_ENDN register  *******************/
#define FDCAN_ENDN_ETV_Pos        (0U)
#define FDCAN_ENDN_ETV_Msk        (0xFFFFFFFFUL << FDCAN_ENDN_ETV_Pos)          /*!< 0xFFFFFFFF */
#define FDCAN_ENDN_ETV            FDCAN_ENDN_ETV_Msk                           /*!<TEndiannes Test Value                   */

/*****************  Bit definition for FDCAN_DBTP register  *******************/
#define FDCAN_DBTP_DSJW_Pos       (0U)
#define FDCAN_DBTP_DSJW_Msk       (0xFUL << FDCAN_DBTP_DSJW_Pos)                /*!< 0x0000000F */
#define FDCAN_DBTP_DSJW           FDCAN_DBTP_DSJW_Msk                          /*!<Synchronization Jump Width              */
#define FDCAN_DBTP_DTSEG2_Pos     (4U)
#define FDCAN_DBTP_DTSEG2_Msk     (0xFUL << FDCAN_DBTP_DTSEG2_Pos)              /*!< 0x000000F0 */
#define FDCAN_DBTP_DTSEG2         FDCAN_DBTP_DTSEG2_Msk                        /*!<Data time segment after sample point    */
#define FDCAN_DBTP_DTSEG1_Pos     (8U)
#define FDCAN_DBTP_DTSEG1_Msk     (0x1FUL << FDCAN_DBTP_DTSEG1_Pos)              /*!< 0x00001F00 */
#define FDCAN_DBTP_DTSEG1         FDCAN_DBTP_DTSEG1_Msk                        /*!<Data time segment before sample point   */
#define FDCAN_DBTP_DBRP_Pos       (16U)
#define FDCAN_DBTP_DBRP_Msk       (0x1FUL << FDCAN_DBTP_DBRP_Pos)               /*!< 0x001F0000 */
#define FDCAN_DBTP_DBRP           FDCAN_DBTP_DBRP_Msk                          /*!<Data BIt Rate Prescaler                 */
#define FDCAN_DBTP_TDC_Pos        (23U)
#define FDCAN_DBTP_TDC_Msk        (0x1UL << FDCAN_DBTP_TDC_Pos)                 /*!< 0x00800000 */
#define FDCAN_DBTP_TDC            FDCAN_DBTP_TDC_Msk                           /*!<Transceiver Delay Compensation          */

