STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp233dxx_cm33.h
/*******************  Bits definition for RISAF_CR register *******************/
#define RISAF_CR_GLOCK_Pos            (0U)
#define RISAF_CR_GLOCK_Msk            (0x1UL << RISAF_CR_GLOCK_Pos)              /*!< 0x00000001 */
#define RISAF_CR_GLOCK                RISAF_CR_GLOCK_Msk

/*******************  Bits definition for RISAF_SR register *******************/
#define RISAF_SR_KEYVALID_Pos         (0U)
#define RISAF_SR_KEYVALID_Msk         (0x1UL << RISAF_SR_KEYVALID_Pos)           /*!< 0x00000001 */
#define RISAF_SR_KEYVALID             RISAF_SR_KEYVALID_Msk

#define RISAF_SR_KEYRDY_Pos           (1U)
#define RISAF_SR_KEYRDY_Msk           (0x1UL << RISAF_SR_KEYRDY_Pos)             /*!< 0x00000002 */
#define RISAF_SR_KEYRDY               RISAF_SR_KEYRDY_Msk

#define RISAF_SR_ENCDIS_Pos           (2U)
#define RISAF_SR_ENCDIS_Msk           (0x1UL << RISAF_SR_ENCDIS_Pos)             /*!< 0x00000004 */
#define RISAF_SR_ENCDIS               RISAF_SR_ENCDIS_Msk

/*******************  Bits definition for RISAF_IASR register *****************/
#define RISAF_IASR_CAEF_Pos           (0U)
#define RISAF_IASR_CAEF_Msk           (0x1UL << RISAF_IASR_CAEF_Pos)             /*!< 0x00000001 */
#define RISAF_IASR_CAEF               RISAF_IASR_CAEF_Msk

#define RISAF_IASR_IAEF0_Pos          (1U)
#define RISAF_IASR_IAEF0_Msk          (0x1UL << RISAF_IASR_IAEF0_Pos)            /*!< 0x00000002 */
#define RISAF_IASR_IAEF0              RISAF_IASR_IAEF0_Msk

#define RISAF_IASR_IAEF1_Pos          (2U)
#define RISAF_IASR_IAEF1_Msk          (0x1UL << RISAF_IASR_IAEF1_Pos)            /*!< 0x00000004 */
#define RISAF_IASR_IAEF1              RISAF_IASR_IAEF1_Msk

/*******************  Bits definition for RISAF_IACR register *****************/
#define RISAF_IACR_CAEF_Pos           (0U)
#define RISAF_IACR_CAEF_Msk           (0x1UL << RISAF_IACR_CAEF_Pos)             /*!< 0x00000001 */
#define RISAF_IACR_CAEF               RISAF_IACR_CAEF_Msk

#define RISAF_IACR_IAEF0_Pos          (1U)
#define RISAF_IACR_IAEF0_Msk          (0x1UL << RISAF_IACR_IAEF0_Pos)            /*!< 0x00000002 */
#define RISAF_IACR_IAEF0              RISAF_IACR_IAEF0_Msk

#define RISAF_IACR_IAEF1_Pos          (2U)
#define RISAF_IACR_IAEF1_Msk          (0x1UL << RISAF_IACR_IAEF1_Pos)            /*!< 0x00000004 */
#define RISAF_IACR_IAEF1              RISAF_IACR_IAEF1_Msk

/*******************  Bits definition for RISAF_IAESR register ****************/
#define RISAF_IAESR_IACID_Pos         (0U)
#define RISAF_IAESR_IACID_Msk         (0x7UL << RISAF_IAESR_IACID_Pos)           /*!< 0x00000007 */
#define RISAF_IAESR_IACID             RISAF_IAESR_IACID_Msk
#define RISAF_IAESR_IACID0            (0x0UL << RISAF_IAESR_IACID_Pos)           /*!< 0x00000000 */
#define RISAF_IAESR_IACID1            (0x1UL << RISAF_IAESR_IACID_Pos)           /*!< 0x00000001 */
#define RISAF_IAESR_IACID2            (0x2UL << RISAF_IAESR_IACID_Pos)           /*!< 0x00000002 */
#define RISAF_IAESR_IACID3            (0x3UL << RISAF_IAESR_IACID_Pos)           /*!< 0x00000003 */
#define RISAF_IAESR_IACID4            (0x4UL << RISAF_IAESR_IACID_Pos)           /*!< 0x00000004 */
#define RISAF_IAESR_IACID5            (0x5UL << RISAF_IAESR_IACID_Pos)           /*!< 0x00000005 */
#define RISAF_IAESR_IACID6            (0x6UL << RISAF_IAESR_IACID_Pos)           /*!< 0x00000006 */
#define RISAF_IAESR_IACID7            (0x7UL << RISAF_IAESR_IACID_Pos)           /*!< 0x00000007 */

#define RISAF_IAESR_IAPRIV_Pos        (4U)
#define RISAF_IAESR_IAPRIV_Msk        (0x1UL << RISAF_IAESR_IAPRIV_Pos)          /*!< 0x00000010 */
#define RISAF_IAESR_IAPRIV            RISAF_IAESR_IAPRIV_Msk

#define RISAF_IAESR_IASEC_Pos         (5U)
#define RISAF_IAESR_IASEC_Msk         (0x1UL << RISAF_IAESR_IASEC_Pos)           /*!< 0x00000020 */
#define RISAF_IAESR_IASEC             RISAF_IAESR_IASEC_Msk

#define RISAF_IAESR_IANRW_Pos         (7U)
#define RISAF_IAESR_IANRW_Msk         (0x1UL << RISAF_IAESR_IANRW_Pos)           /*!< 0x00000080 */
#define RISAF_IAESR_IANRW             RISAF_IAESR_IANRW_Msk

/*******************  Bits definition for RISAF_IADDR register ****************/
#define RISAF_IADDR_IADD_Pos          (0U)
#define RISAF_IADDR_IADD_Msk          (0xFFFFFFFFUL << RISAF_IADDR_IADD_Pos)     /*!< 0xFFFFFFFF */
#define RISAF_IADDR_IADD              RISAF_IADDR_IADD_Msk

/*******************  Bits definition for RISAF_KEYR0 register ****************/
#define RISAF_KEYR0_KEY_Pos           (0U)
#define RISAF_KEYR0_KEY_Msk           (0xFFFFFFFFUL << RISAF_KEYR0_KEY_Pos)      /*!< 0xFFFFFFFF */
#define RISAF_KEYR0_KEY               RISAF_KEYR0_KEY_Msk

/*******************  Bits definition for RISAF_KEYR1 register ****************/
#define RISAF_KEYR1_KEY_Pos           (0U)
#define RISAF_KEYR1_KEY_Msk           (0xFFFFFFFFUL << RISAF_KEYR1_KEY_Pos)      /*!< 0xFFFFFFFF */
#define RISAF_KEYR1_KEY               RISAF_KEYR1_KEY_Msk

/*******************  Bits definition for RISAF_KEYR2 register ****************/
#define RISAF_KEYR2_KEY_Pos           (0U)
#define RISAF_KEYR2_KEY_Msk           (0xFFFFFFFFUL << RISAF_KEYR2_KEY_Pos)      /*!< 0xFFFFFFFF */
#define RISAF_KEYR2_KEY               RISAF_KEYR2_KEY_Msk

/*******************  Bits definition for RISAF_KEYR3 register ****************/
#define RISAF_KEYR3_KEY_Pos           (0U)
#define RISAF_KEYR3_KEY_Msk           (0xFFFFFFFFUL << RISAF_KEYR3_KEY_Pos)      /*!< 0xFFFFFFFF */
#define RISAF_KEYR3_KEY               RISAF_KEYR3_KEY_Msk

/*******************  Bits definition for RISAF_REGx_CFGR register ************/
#define RISAF_REGCFGR_BREN_Pos        (0U)
#define RISAF_REGCFGR_BREN_Msk        (0x1UL << RISAF_REGCFGR_BREN_Pos)          /*!< 0x00000001 */
#define RISAF_REGCFGR_BREN            RISAF_REGCFGR_BREN_Msk

#define RISAF_REGCFGR_SEC_Pos         (8U)
#define RISAF_REGCFGR_SEC_Msk         (0x1UL << RISAF_REGCFGR_SEC_Pos)           /*!< 0x00000100 */
#define RISAF_REGCFGR_SEC             RISAF_REGCFGR_SEC_Msk

#define RISAF_REGCFGR_ENC_Pos         (15U)
#define RISAF_REGCFGR_ENC_Msk         (0x1UL << RISAF_REGCFGR_ENC_Pos)           /*!< 0x00008000 */
#define RISAF_REGCFGR_ENC             RISAF_REGCFGR_ENC_Msk

#define RISAF_REGCFGR_PRIV_Pos        (16U)
#define RISAF_REGCFGR_PRIV_Msk        (0xFFUL << RISAF_REGCFGR_PRIV_Pos)         /*!< 0x00FF0000 */
#define RISAF_REGCFGR_PRIV            RISAF_REGCFGR_PRIV_Msk
#define RISAF_REGCFGR_PRIVC0          (0x1UL << RISAF_REGCFGR_PRIV_Pos)          /*!< 0x00010000 */
#define RISAF_REGCFGR_PRIVC1          (0x2UL << RISAF_REGCFGR_PRIV_Pos)          /*!< 0x00020000 */
#define RISAF_REGCFGR_PRIVC2          (0x4UL << RISAF_REGCFGR_PRIV_Pos)          /*!< 0x00040000 */
#define RISAF_REGCFGR_PRIVC3          (0x8UL << RISAF_REGCFGR_PRIV_Pos)          /*!< 0x00080000 */
#define RISAF_REGCFGR_PRIVC4          (0x10UL << RISAF_REGCFGR_PRIV_Pos)         /*!< 0x00100000 */
#define RISAF_REGCFGR_PRIVC5          (0x20UL << RISAF_REGCFGR_PRIV_Pos)         /*!< 0x00200000 */
#define RISAF_REGCFGR_PRIVC6          (0x40UL << RISAF_REGCFGR_PRIV_Pos)         /*!< 0x00400000 */
#define RISAF_REGCFGR_PRIVC7          (0x80UL << RISAF_REGCFGR_PRIV_Pos)         /*!< 0x00800000 */

/*******************  Bits definition for RISAF_REGx_STARTR register **********/
#define RISAF_REGSTARTR_BADDSTART_Pos (0U)
#define RISAF_REGSTARTR_BADDSTART_Msk (0xFFFFFFFFUL << RISAF_REGSTARTR_BADDSTART_Pos)  /*!< 0xFFFFFFFF */
#define RISAF_REGSTARTR_BADDSTART     RISAF_REGSTARTR_BADDSTART_Msk

/*******************  Bits definition for RISAF_REGx_ENDR register ************/
#define RISAF_REGENDR_BADDEND_Pos     (0U)
#define RISAF_REGENDR_BADDEND_Msk     (0xFFFFFFFFUL << RISAF_REGENDR_BADDEND_Pos)  /*!< 0xFFFFFFFF */
#define RISAF_REGENDR_BADDEND         RISAF_REGENDR_BADDEND_Msk

/*******************  Bits definition for RISAF_REGx_CIDCFGR register *********/
#define RISAF_REGCIDCFGR_RDEN_Pos     (0U)
#define RISAF_REGCIDCFGR_RDEN_Msk     (0xFFUL << RISAF_REGCIDCFGR_RDEN_Pos)      /*!< 0x000000FF */
#define RISAF_REGCIDCFGR_RDEN         RISAF_REGCIDCFGR_RDEN_Msk
#define RISAF_REGCIDCFGR_RDENC0       (0x1UL << RISAF_REGCIDCFGR_RDEN_Pos)       /*!< 0x00000001 */
#define RISAF_REGCIDCFGR_RDENC1       (0x2UL << RISAF_REGCIDCFGR_RDEN_Pos)       /*!< 0x00000002 */
#define RISAF_REGCIDCFGR_RDENC2       (0x4UL << RISAF_REGCIDCFGR_RDEN_Pos)       /*!< 0x00000004 */
#define RISAF_REGCIDCFGR_RDENC3       (0x8UL << RISAF_REGCIDCFGR_RDEN_Pos)       /*!< 0x00000008 */
#define RISAF_REGCIDCFGR_RDENC4       (0x10UL << RISAF_REGCIDCFGR_RDEN_Pos)      /*!< 0x00000010 */
#define RISAF_REGCIDCFGR_RDENC5       (0x20UL << RISAF_REGCIDCFGR_RDEN_Pos)      /*!< 0x00000020 */
#define RISAF_REGCIDCFGR_RDENC6       (0x40UL << RISAF_REGCIDCFGR_RDEN_Pos)      /*!< 0x00000040 */
#define RISAF_REGCIDCFGR_RDENC7       (0x80UL << RISAF_REGCIDCFGR_RDEN_Pos)      /*!< 0x00000080 */

#define RISAF_REGCIDCFGR_WREN_Pos     (16U)
#define RISAF_REGCIDCFGR_WREN_Msk     (0xFFUL << RISAF_REGCIDCFGR_WREN_Pos)      /*!< 0x00FF0000 */
#define RISAF_REGCIDCFGR_WREN         RISAF_REGCIDCFGR_WREN_Msk
#define RISAF_REGCIDCFGR_WRENC0       (0x1UL << RISAF_REGCIDCFGR_WREN_Pos)       /*!< 0x00010000 */
#define RISAF_REGCIDCFGR_WRENC1       (0x2UL << RISAF_REGCIDCFGR_WREN_Pos)       /*!< 0x00020000 */
#define RISAF_REGCIDCFGR_WRENC2       (0x4UL << RISAF_REGCIDCFGR_WREN_Pos)       /*!< 0x00040000 */
#define RISAF_REGCIDCFGR_WRENC3       (0x8UL << RISAF_REGCIDCFGR_WREN_Pos)       /*!< 0x00080000 */
#define RISAF_REGCIDCFGR_WRENC4       (0x10UL << RISAF_REGCIDCFGR_WREN_Pos)      /*!< 0x00100000 */
#define RISAF_REGCIDCFGR_WRENC5       (0x20UL << RISAF_REGCIDCFGR_WREN_Pos)      /*!< 0x00200000 */
#define RISAF_REGCIDCFGR_WRENC6       (0x40UL << RISAF_REGCIDCFGR_WREN_Pos)      /*!< 0x00400000 */
#define RISAF_REGCIDCFGR_WRENC7       (0x80UL << RISAF_REGCIDCFGR_WREN_Pos)      /*!< 0x00800000 */

